---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.MEPSpaceConstruction
source: html/cc5eae84-2176-4c7d-2462-e808b777e950.htm
---
# Autodesk.Revit.DB.Mechanical.MEPSpaceConstruction

Construction definition for Space.

## Syntax (C#)
```csharp
public class MEPSpaceConstruction
```

## Remarks
This is used to define the information in Constructions.xml.